# StructuralSectionGeneralLZ Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralLZ Class
Members See Also
---
Defines parameters for Z Cold Formed shape.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralSectionGeneralLZ : StructuralSectionColdFormed
```

Visual Basic
---
```text
Public Class StructuralSectionGeneralLZ _
	Inherits StructuralSectionColdFormed
```

Visual C++
---
```text
public ref class StructuralSectionGeneralLZ : public StructuralSectionColdFormed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralLZ Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionZProfile Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionZProfileWithLips
# See Also
StructuralSectionGeneralLZ Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace